Repository: Vuizur/WordDumb
Catalog: translations/*.po
Languages: fr

source: Preferred format order
fr: Ordre de préférence des formats

source: Customize Kindle Word Wise
fr: Personnaliser Kindle Word Wise

source: Customize EPUB Wiktionary
fr: Personnaliser EPUB Wiktionary

source: Use POS type to find Word Wise definition
fr: Utiliser le type du PoS pour trouver ls définition Word Wise

source: Fetch X-Ray people descriptions from Wikipedia/Fandom
fr: Chercher les descriptions de personnes X-Ray depuis Wikipedia/Fandom

source: Enable this option for nonfiction books and novels that have character pages on Wikipedia/Fandom
fr: Activez cette option pour les livres non-fiction et nouvelles qui ont des pages de personnage sur Wikipedia/Fandom

source: Run spaCy with GPU(requires CUDA)
fr: Exécuter spaCy sur le GPU(requiert CUDA)

source: GPU will be used when creating X-Ray file if spaCy has transformer model for the book language with ner component.
fr: Le GPU sera utilisé à la création du fichier X-Ray si spaCy inclut un modèle transformer ayant le composant ner pour le langage de ce livre.

source: CUDA version
fr: Version CUDA

source: Use command "nvcc --version" to check CUDA version
fr: Utilisez la commande "nvcc --version" pour vérifier la version CUDA

source: <a href="https://spacy.io/models/en">spaCy model</a> size
fr: <a href="https://spacy.io/models/en">Modèle spaCy</a> taille

source: Larger model improves X-Ray quality
fr: Un modèle plus grand améliore la qualité X-Ray

source: Small
fr: Petit

source: Medium
fr: Moyen

source: Large
fr: Grand

source: Minimal X-Ray occurrences
fr: Occurrences X-Ray minima

source: X-Ray entities that appear less then this number and don't have description from Wikipedia/Fandom will be removed
fr: Les entités X-Ray qui sont en nombre inférieur à ce chiffre et qui n'ont pas de description depuis Wikipedia/Fandom seront enlevées

source: Chinese Wikipedia variant
fr: Variante Wikipedia Chinoise

source: Add locator map to EPUB footnotes
fr: Ajouter une carte de localisation aux notes de bas de page EPUB

source: Enable this option if your e-reader supports image in footnotes
fr: Activez cette option si votre liseuse prend en charge les images en bas de page

source: Source code
fr: Code source

source: Downloading Word Wise file
fr: Téléchargeant le fichier Word Wise

source: Saving customized lemmas
fr: Sauvant les lemmes personnalisés

source: Exporting customized lemmas
fr: Exportant les lemmes personnalisés

source: Choose format manually
fr: Choisir le format manuellement

source: Create files for all available formats
fr: Créer les fichiers pour tous les formats disponibles

source: Choose book format
fr: Choisir le format du livre

source: This book has multiple supported formats. Choose the format you want to use.
fr: Ce livre a plusieurs formats pris en charge. Choisissez le format que vous voulez utiliser.

source: Always ask when more than one format is available
fr: Toujours demander quand il y a plus d'un format

source: Choose language
fr: Choisissez la langue

source: Lemma language
fr: Langue des lemmes

source: Gloss language
fr: Langue du glose

source: Use Wiktionary definition
fr: Utiliser la définition Wiktionary

source: Change Word Wise language to Chinese on your Kindle device to view definition from Wiktionary
fr: Changez la langue de Word Wise en chinois sur votre appareil Kindle pour afficher la définition de Wiktionary

source: Customize Wiktionary
fr: Personnaliser Wiktionary

source: Fewer Hints
fr: Moins d'indices

source: More Hints
fr: Plus d'indices

source: Filter lemma
fr: Filtre lemmes

source: All
fr: Tout

source: Enabled
fr: Activé

source: Disabled
fr: Désactivé

source: Filter enabled
fr: Filtre activé

source: Filter difficulty
fr: Filtre difficulté

source: General American
fr: Américain général

source: Received Pronunciation
fr: Prononciation reçue

source: Phonetic transcription system
fr: Système de transcription phonétique

source: International Phonetic Alphabet
fr: Alphabet Phonétique International

source: Difficulty limit
fr: Limite de difficulté

source: Difficult words have lower value. Words have difficulty value higher than this value are disabled.
fr: Les mots plus difficiles ont une valeur inférieure. Les mots ayant une valeur de difficulté supérieure à cette valeur sont désactivés.

source: Import
fr: Importer

source: Export
fr: Exporter

source: Select import file
fr: Sélectionner le fichier d'importation

source: Set export file path
fr: Régler le chemin d'exportation du fichier

source: Lemma
fr: Lemme

source: Gloss
fr: Glose

source: Difficulty
fr: Difficulté

source: Set export options
fr: Régler les options d'exportation

source: Export text separated by tab, can be imported to Anki.<br/> "Allow HTML in fields" option needs to be enabled in Anki.
fr: Exporter du texte séparé par tabulation, peut être importé vers Anki.<br/> l'option "Permettre les champs HTML" doit être sélectionnée dans Anki.

source: Only export enabled lemmas
fr: Exporter seulement les lemmes en vigueur

source: Difficulty higher than this value will not be exported
fr: Niveaux de difficulté supérieurs à cette valeur ne seront pas exportés

source: Set import options
fr: Régler les options d'importation

source: Retain current enabled lemmas
fr: Garder les lemmes actuellement en vigueur

source: Named hurricanes, battles, wars, sports events, etc.
fr: Noms d'ouragans, batailles, guerres, sports, évènements, etc.

source: Buildings, airports, highways, bridges, etc.
fr: Immeubles, aéroports, ponts, etc.

source: Countries, cities, states
fr: Pays, villes, états

source: Named documents made into laws
fr: Documents nommés devenus lois

source: Non-GPE locations, mountain ranges, bodies of water
fr: Emplacements non-GPE, chaînes de montagnes, étendues d'eau

source: Companies, agencies, institutions, etc.
fr: Compagnies, agences, institutions, etc.

source: People, including fictional
fr: Personnes, incluant fictives

source: Objects, vehicles, foods, etc. (not services)
fr: Objets, véhicules, aliments, etc. (pas prestation de service)

source: Book quote
fr: Citation du livre

source: Customize X-Ray for {}
fr: Personnaliser X-Ray pour {}

source: Search
fr: Chercher

source: Add
fr: Ajouter

source: Delete
fr: Supprimer

source: Name
fr: Nom

source: Named entity label
fr: Étiquette de l'entité Nom

source: Aliases
fr: Pseudonymes

source: Description source
fr: Source de la description

source: Omit
fr: Omettre

source: Add new X-Ray data
fr: Ajouter nouvelles données X-Ray

source: NER label
fr: Étiquette NER

source: Separate by ","
fr: Séparé par ","

source: Leave this empty to use description from Wikipedia or Fandom
fr: Garder cette entrée vide pour utiliser la description depuis Wikipedia ou Fandom

source: Can't find Python. Please read the <a href='{}'>document</a> of how to install Python.
fr: Impossible de trouver Python. Veuillez lire le <a href='{}'>document</a> sur l'installation de Python.

source: Your Python version is too old, please update to a newer version and read the <a href='{}'>document</a> for more information.
fr: Votre version de Python est trop ancienne, veuillez la mettre à jour et lire le document <a href='{}'>document</a> pour plus d'informations.

source: Please use <a href='https://github.com/kevinhendricks/KindleUnpack'>KindleUnpack</a>'s '-s' option to split the book.
fr: Veuillez utiliser l'option s '-s' de <a href='https://github.com/kevinhendricks/KindleUnpack'>KindleUnpack</a>pour fragmenter le livre.

source: Install <a href='https://support.microsoft.com/en-us/help/2977003/the-latest-supported-visual-c-downloads'>Visual C++ 2019 Redistributable</a>
fr: Installer <a href='https://support.microsoft.com/en-us/help/2977003/the-latest-supported-visual-c-downloads'>Visual C++ 2019 Redistributable</a>

source: <p>Please read the friendly <a href='{}'>manual</a> of how to install pip.</p><p>If you still have this error, make sure you installed calibre with the <a href='https://calibre-ebook.com/download_linux'>binary install command</a> but not from Flathub or Snap Store.</p>
fr: <p>Veuillez lire le <a href='{}'>manuel</a> sur l'installation de pip.</p><p>Si vous avez toujours cette erreur, assurez-vous d'installer calibre depuis la commande d'installation<a href='https://calibre-ebook.com/download_linux'>binaire</a> mais pas depuis Flathub ou Snap Store.</p>

source: Can't find CUDA
fr: CUDA introuvable

source: 'Run spaCy with GPU' feature requires <a href='https://developer.nvidia.com/cuda-downloads'>CUDA</a>
fr: 'Exécuter spaCy sur le GPU' requiert <a href='https://developer.nvidia.com/cuda-downloads'>CUDA</a>

source: Please delete the '{}/worddumb-libs-py*' folder then try again.
fr: Veuillez effacer le dossier '{}/worddumb-libs-py*' et essayez à nouveau.

source: <p>Read <a href='{}'>calibre FAQ</a> first then check your proxy environment variables, they should be set by these commands:</p><p><code>$ export HTTP_PROXY='http://host:port'</code></p><p><code>$ export HTTPS_PROXY='http://host:port'</code></p><p>If you're allergic to terminal, close your proxy and use a VPN.</p>
fr: <p>Lisez <a href='{}'>calibre FAQ</a> d'abord, puis vérifiez les variables d'environnement de votre procurateur, elles devraient être initialisées par ces commandes:</p><p><code>$ export HTTP_PROXY='http://host:port'</code></p><p><code>$ export HTTPS_PROXY='http://host:port'</code></p><p>Si vous êtes rebutés par le terminal, fermez votre procurateur et utilisez un VPN.</p>

source: Is GitHub/Wikipedia/Fandom blocked by your ISP? You might need to bypass Internet censorship. Please read <a href='{}'>calibre FAQ</a>.
fr: GitHub/Wikipedia/Fandom sont-ils bloqués par votre ISP? Vous pourriez avoir besoin de contourner la censure Internet. Veuillez lire <a href='{}'>calibre FAQ</a>.

source: An error occurred, please copy error message then report bug at <a href="{}/issues">GitHub</a>.
fr: Une erreur s'est produite, veuillez copier le message d'erreur et rapportez le problème à <a href="{}/issues">GitHub</a>.

source: Unsupported language
fr: Langue non prise en charge

source: The language of the book <i>{}</i> is not supported.
fr: La langue du livre <i>{}</i> n'est pas prise en charge.

source: Unsupported book format
fr: Format de livre non pris en charge

source: The book format is not supported.
fr: Ce format de livre n'est pas pris en charge.

source: Device not found
fr: Appareil introuvable

source: Definition data will be added when Kindle or Android(requires adb) device is connected.
fr: Les définitions seront ajoutées quand l'appareil Kindle ou Android(requiert adb) sera connecté.

source: Word Wise database not found
fr: Base de données Word Wise introuvable

source: Can't find Word Wise database on your device, open a Word Wise enabled book to download this file.
fr: Base de données Word Wise introuvable sur votre appareil, ouvrez un livre prenant en charge Word Wise pour télécharger ce fichier.

source: Kindle doesn't support EPUB
fr: Le Kindle ne prend pas en charge le format EPUB

source: Kindle doesn't support EPUB format natively, please convert the book format then try again.
fr: Le Kindle ne prend pas en charge le format EPUB nativement, veuillez convertir le format du livre et essayez à nouveau.

source: Book language {} is not supported for Word Wise gloss language {}.
fr: La langue {} du livre n'est pas prise en charge pour les glose Word Wise de langue {}

source: Create Word Wise and X-Ray
fr: Créer Word Wise et X-Ray

source: Create Word Wise
fr: Créer Word Wise

source: Create X-Ray
fr: Créer X-Ray

source: Customize X-Ray
fr: Personnaliser X-Ray

source: Preferences
fr: Paramètres

source: Donate
fr: Donner

source: and
fr: et

source: Generating {} for {}
fr: Générant {} pour {}

source: {} generated for {}
fr: {} généré pour {}

source: Danish
fr: Danois

source: German
fr: Allemand

source: Greek
fr: Grec

source: English
fr: Anglais

source: Finnish
fr: Finlandais

source: French
fr: Français

source: Serbo-Croatian
fr: Serbo-Croate

source: Italian
fr: Italien

source: Japanese
fr: Japonais

source: Korean
fr: Coréen

source: Lithuanian
fr: Lituanien

source: Macedonian
fr: Macédonien

source: Dutch
fr: Néerlandais

source: Norwegian Bokmål
fr: Norvégien Bokmål

source: Polish
fr: Polonais

source: Portuguese
fr: Portugais

source: Romanian
fr: Roumain

source: Russian
fr: Russe

source: Spanish
fr: Espagnol

source: Swedish
fr: Suédois

source: Ukrainian
fr: Ukrainien

source: Chinese
fr: Chinois
